TestingTool_3-0/src/Catalogs/ДействияЗаданий/ДействияЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДействияЗаданий</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Архив</name>
      <description>Архив</description>
    </items>
    <items>
      <name>Служебные</name>
      <description>Служебные</description>
    </items>
  </predefined>
  <attributes>
    <name>Каталог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработка</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтовыеАдреса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДействия</name>
    <type>
      <types>EnumRef.ТипыДействийЗаданий</types>
    </type>
  </attributes>
  <attributes>
    <name>КоманднаяСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Код1С</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Время</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремя</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Интервал</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоявлениеФайла</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсутствиеФайла</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Алгоритм</name>
    <type>
      <types>CatalogRef.Алгоритмы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПроцедурыОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелоПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКомандуПлатформыЗапуститьПриложение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКоманды</name>
    <type>
      <types>CatalogRef.ШаблоныКоманд</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьШаблонКоманды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАлгоритм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКонструктора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьКонструктором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьОтдельнымФоновымЗаданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestingTool_3-0/src/Enums/ТипыДействийЗаданий/ТипыДействийЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДействийЗаданий</name>
  <enumValues>
    <name>ВыгрузитьДополнительнуюОбработкуОтчетВФайл</name>
  </enumValues>
  <enumValues>
    <name>ВыполнитьОбработку</name>
  </enumValues>
  <enumValues>
    <name>ВыполнитьПроизвольныйКодСервер</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытьПриложение</name>
  </enumValues>
  <enumValues>
    <name>ЗапуститьПриложение</name>
  </enumValues>
  <enumValues>
    <name>ОжидатьСобытие</name>
  </enumValues>
  <enumValues>
    <name>ОтправитьПочту</name>
  </enumValues>
  <enumValues>
    <name>Пустое</name>
  </enumValues>
</mdclass:Enum>

TestingTool_3-0/src/Catalogs/ДействияЗаданий/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОбработаннуюСтрокуПоШаблону();
	Если ЗначениеЗаполнено(Объект.Комментарий) Тогда
		Элементы.СтраницаКомментарий.Картинка = БиблиотекаКартинок.Карандаш_16х16;
	КонецЕсли;
	ОформлениеОтображенияПоТипуДействия();
	
	СформироватьОписаниеКомандШаблонов();
	ЗаполнитьОбработанныйПутьКФайлуПоШаблону();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИзменитьВидимостьАлгоритмКод();
	ИзменитьВидимостьШаблона();
	ИзменитьВидимостьРабочегоМеста();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьДействиеНаСервере()
	
	Если Объект.ИспользоватьАлгоритм=Ложь Тогда
		Выполнить(Объект.Код1С);
	Иначе
		Выполнить(Объект.Алгоритм.Код);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	ВыполнитьДействиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПриложениеЛокально(Команда)
	
	СтрокаКоманды = "";
	
	Если Объект.ИспользоватьШаблонКоманды=Истина Тогда
		ЗаполнитьОбработаннуюСтрокуПоШаблону();
		СтрокаКоманды = ОбработаннаяСтрокаКоманды;
	Иначе
		СтрокаКоманды = Объект.КоманднаяСтрока;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаКоманды) Тогда
		ВызватьИсключение "Командная строка пустая. Запуск не возможен!";
	КонецЕсли;
	
	Если Объект.ИспользоватьКомандуПлатформыЗапуститьПриложение=Истина Тогда
		ЗапуститьПриложение(СтрокаКоманды);
	Иначе
		Если ЗначениеЗаполнено(Объект.РабочееМесто) Тогда
			СтруктураКомпьютера = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.РабочееМесто,"ИмяКомпьютера,IPv4");
			Компьютер = "";
			Если ЗначениеЗаполнено(СтруктураКомпьютера.IPv4) Тогда
				Компьютер = СтруктураКомпьютера.IPv4;
			ИначеЕсли ЗначениеЗаполнено(СтруктураКомпьютера.ИмяКомпьютера) Тогда
				Компьютер = СтруктураКомпьютера.ИмяКомпьютера;
			КонецЕсли;
			ПИД = ПланировщикЗаданийКлиентСервер.ЗапуститьПриложениеУдаленно(СтрокаКоманды,Компьютер);
		Иначе
			ПИД = ПланировщикЗаданийКлиентСервер.ЗапуститьПриложениеЛокально(СтрокаКоманды);
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПриложениеЛокально(Команда)
	Сообщение = "";
	ПланировщикЗаданийКлиентСервер.ЗавершитьПроцессЛокально(ПИД,Сообщение);
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ТестируемыйКлиентПриИзменении(Элемент)
	
КонецПроцедуры

&НаСервере
Процедура ОформлениеОтображенияПоТипуДействия()
	
	Элементы.СтраницыВариантыДействия.ОтображениеСтраниц=ОтображениеСтраницФормы.Нет;
	Элементы.СтраницаКомандыШаблонов.Видимость = Ложь;
	
	Если Объект.ТипДействия = Перечисления.ТипыДействийЗаданий.ПустаяСсылка() 
		ИЛИ Объект.ТипДействия = Перечисления.ТипыДействийЗаданий.Пустое Тогда
		Элементы.СтраницыВариантыДействия.ТекущаяСтраница = Элементы.СтраницаПоУмолчанию;
		Элементы.СтраницаПоУмолчанию.Видимость = Истина;
	ИначеЕсли Объект.ТипДействия = Перечисления.ТипыДействийЗаданий.ЗапуститьПриложение  Тогда
		Элементы.СтраницыВариантыДействия.ТекущаяСтраница = Элементы.СтраницаЗапуститьПриложение;
		Элементы.СтраницаКомандыШаблонов.Видимость = Истина;
	ИначеЕсли Объект.ТипДействия = Перечисления.ТипыДействийЗаданий.ЗакрытьПриложение  Тогда
		Элементы.СтраницыВариантыДействия.ТекущаяСтраница = Элементы.СтраницаЗакрытьПриложение;
	ИначеЕсли Объект.ТипДействия = Перечисления.ТипыДействийЗаданий.ОжидатьСобытие  Тогда
		Элементы.СтраницыВариантыДействия.ТекущаяСтраница = Элементы.СтраницаСобытие;
	ИначеЕсли Объект.ТипДействия = Перечисления.ТипыДействийЗаданий.ОтправитьПочту  Тогда
		Элементы.СтраницыВариантыДействия.ТекущаяСтраница = Элементы.СтраницаПочта;
	ИначеЕсли Объект.ТипДействия = Перечисления.ТипыДействийЗаданий.ВыгрузитьДополнительнуюОбработкуОтчетВФайл  Тогда
		Элементы.СтраницыВариантыДействия.ТекущаяСтраница = Элементы.СтраницаОперацияСОбработкой;
	ИначеЕсли Объект.ТипДействия = Перечисления.ТипыДействийЗаданий.ВыполнитьОбработку  Тогда
		Элементы.СтраницыВариантыДействия.ТекущаяСтраница = Элементы.СтраницаВыполнитьОбработку;
	ИначеЕсли Объект.ТипДействия = Перечисления.ТипыДействийЗаданий.ВыполнитьПроизвольныйКодСервер Тогда
		Элементы.СтраницыВариантыДействия.ТекущаяСтраница = Элементы.СтраницаКод1С;
	Иначе
		Элементы.СтраницыВариантыДействия.ОтображениеСтраниц=ОтображениеСтраницФормы.ЗакладкиСверху;
		Элементы.СтраницаПоУмолчанию.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДействияПриИзменении(Элемент)
	ОформлениеОтображенияПоТипуДействия();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Комментарий) Тогда
		Элементы.СтраницаКомментарий.Картинка = БиблиотекаКартинок.Карандаш_16х16;
	Иначе
		Элементы.СтраницаКомментарий.Картинка = новый Картинка;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура СформироватьОписаниеКомандШаблонов()
	
	ОписаниеКомандШаблонов = "<html><head></head><body>";
	
	ОписаниеКомандШаблонов = ОписаниеКомандШаблонов +"&nbsp; <b>%ПутьКИсполняемомуФайлу1С%</b> -  путь к исполняемому файлу 1с из настроек пользователя на текущем компьютере "+"<br />";
	ОписаниеКомандШаблонов = ОписаниеКомандШаблонов +"&nbsp; <b>%НомерПроверки%</b> - номер проверки в рамках выполняемого задания "+"<br />";
	ОписаниеКомандШаблонов = ОписаниеКомандШаблонов +"&nbsp; <b>%НомерПоследнейПроверки%</b> - номер проверки в рамках выполняемого задания "+"<br />";
	ОписаниеКомандШаблонов = ОписаниеКомандШаблонов +"&nbsp; <b>%ТекущаяДата%</b> - текущая дата представление"+"<br />";
	ОписаниеКомандШаблонов = ОписаниеКомандШаблонов +"&nbsp; <b>%ПутьКаталогGIT%</b>  - путь к каталогу GIT из настроек пользователя на текущем компьютере "+"<br />";
	ОписаниеКомандШаблонов = ОписаниеКомандШаблонов +"&nbsp; <b>%ПутьКаталогаОтчетаВыполнения%</b>  - путь к каталогу сохранения отчетов из настроек пользователя на текущем компьютере "+"<br />";
	ОписаниеКомандШаблонов = ОписаниеКомандШаблонов +"&nbsp; <b>%ПутьКаталогаБлокГотовыхШагов%</b>  - путь к каталогу сохранения отчетов из настроек пользователя на текущем компьютере "+"<br />";
	ОписаниеКомандШаблонов = ОписаниеКомандШаблонов +"&nbsp; <b>%ПутьКВременномуКаталогуФайлов%</b>  - путь к каталогу сохранения отчетов из настроек пользователя на текущем компьютере "+"<br />";
	ОписаниеКомандШаблонов = ОписаниеКомандШаблонов +"&nbsp; <b>%ТекущийПользователь%</b>  - текущий пользователь представление "+"<br />";
	ОписаниеКомандШаблонов = ОписаниеКомандШаблонов +"&nbsp; <b>%ТекущийПользовательНаименованиеСокращенное%</b>  - текущий пользователь наименование сокращенное "+"<br />";
	ОписаниеКомандШаблонов = ОписаниеКомандШаблонов +"&nbsp; <b>%ТекущееРабочееМесто%</b>  - текущее рабочее место представление "+"<br />";
	ОписаниеКомандШаблонов = ОписаниеКомандШаблонов +"&nbsp; <b>%ИмяПеременной%</b> - переменная из регистра сведений переменные пользователь/заданий/действий (порядок применения права на лево) "+"<br />";
	
	ОписаниеКомандШаблонов = ОписаниеКомандШаблонов + "</body></html>";
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбработаннуюСтрокуПоШаблону()
	
	ОбработаннаяСтрокаКоманды = "";
	
	Если Объект.ИспользоватьШаблонКоманды=Истина Тогда
		мПараметры = новый Структура("Действие",Объект.Ссылка);
		ОбработаннаяСтрокаКоманды = СценарноеТестированиеСервер.ОбработатьСтрокуПоПараметрам(Объект.ШаблонКоманды.ТекстШаблона,мПараметры); 		
	Иначе
		мПараметры = новый Структура("Действие",Объект.Ссылка);
		ОбработаннаяСтрокаКоманды = СценарноеТестированиеСервер.ОбработатьСтрокуПоПараметрам(Объект.КоманднаяСтрока,мПараметры); 		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьШаблонКомандыПриИзменении(Элемент)
	ИзменитьВидимостьШаблона();
	ЗаполнитьОбработаннуюСтрокуПоШаблону();
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяСтрокаПриИзменении(Элемент)
	ЗаполнитьОбработаннуюСтрокуПоШаблону();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлу1ПриИзменении(Элемент)
	ЗаполнитьОбработанныйПутьКФайлуПоШаблону();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьОбработанныйПутьКФайлуПоШаблону()
	
	Если Объект.ИспользоватьШаблонКоманды=Ложь Тогда
		Возврат;
	КонецЕсли;
	
	мПараметры = новый Структура("Действие",Объект.Ссылка);
	ПутьКФайлуСтрока = СценарноеТестированиеСервер.ОбработатьСтрокуПоПараметрам(Объект.ПутьКФайлу,мПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьШаблонКоманды2ПриИзменении(Элемент)
	ЗаполнитьОбработанныйПутьКФайлуПоШаблону();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьАлгоритмПриИзменении(Элемент)
	ИзменитьВидимостьАлгоритмКод();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбработаннуюКоманднуюСтроку(Команда)
	ЗаполнитьОбработаннуюСтрокуПоШаблону();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонКомандыПриИзменении(Элемент)
	ЗаполнитьОбработаннуюСтрокуПоШаблону();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКомандуПлатформыЗапуститьПриложениеПриИзменении(Элемент)
	ИзменитьВидимостьРабочегоМеста();
КонецПроцедуры

#Область УправлениеОтображением

&НаКлиенте
Процедура ИзменитьВидимостьШаблона()
	
	
	Если Объект.ИспользоватьШаблонКоманды=Истина Тогда
		Элементы.ШаблонКоманды.Видимость = Истина;
		Элементы.КоманднаяСтрока.Видимость = Ложь;
	Иначе
		Элементы.ШаблонКоманды.Видимость = Ложь;
		Элементы.КоманднаяСтрока.Видимость = Истина;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьАлгоритмКод()
	
	Если Объект.ИспользоватьАлгоритм=Истина Тогда
		Элементы.Алгоритм.Видимость = Истина;
		Элементы.Код1С.Видимость = Ложь;
	Иначе
		Элементы.Алгоритм.Видимость = Ложь;
		Элементы.Код1С.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьРабочегоМеста()
	
	ВидимостьСпецДействий = НЕ Объект.ИспользоватьКомандуПлатформыЗапуститьПриложение;
	
	Элементы.РабочееМесто.Видимость = ВидимостьСпецДействий;
	Элементы.РабочееМесто1.Видимость  = ВидимостьСпецДействий;
	Элементы.ПИД.Видимость  = ВидимостьСпецДействий;
	Элементы.ПИД1.Видимость  = ВидимостьСпецДействий;
	Элементы.ЗакрытьПриложение.Видимость = ВидимостьСпецДействий;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры


#КонецОбласти

#Область Новое

#КонецОбласти
